export default {
  // 中文名称
  name_zh: /^[\u4e00-\u9fa5]{2,}$/,
  // 非中文字符
  not_zh: /^[^\u4e00-\u9fa5（）《》【】、，；：。？！‘’“”·￥…]+$/,
  // 英文名称
  name_en: /^[ 0-9A-Za-z]+$/,
  // 数字
  number: /^\d+$/,
  // 验证码
  code: /^\d{4}$/,
  // 数字+字母
  inviteCode: /^[0-9a-zA-Z]+$/,
  // 取前3,最后4个
  begin3end4: /^(\d{3})\d+(\d{4})$/,
  // 座机
  tel: /^0\d{2,3}-?\d{7,8}$/,
  // 手机
  mobile: /^1[3456789]\d{9}$/,
  // 座机和手机
  phone: /^(0\d{2,3}-?\d{7,8})|(1[3456789]\d{9})$/,
  // 邮箱
  email: /^\w+([+-.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  // 身份证
  id_card: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X|x)$/,
  // 价格
  price: /^([1-9]\d{0,9}|0)([.]?|(\.\d{1,2})?)$/,
  // 6-16位数字、字母组合密码
  letterDigit: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,16}$/
};
